Repository: Phosphorus-M/budgie-welcome
Catalog: data/po/recommendations/*.po
Languages: fi

source: Recommendations
fi: Suosittelut

source: Backports repository
fi: Takaportit-ohjelmavarasto

source: To provide the most up-to-date versions of budgie-desktop and other associated packages, we recommend to enable the <span name="distro-name"></span> backports repository.
fi: Jotta budgie-työpöydän tai siihen liittyvät kaikkein uusimmat pakettiversiot olisivat saatavilla, suosittelemme ottamaan käyttöön <span name="distro-name"></span>takaportit-ohjelmavaraston.

source: Repository is installed
fi: Ohjelmavarasto asennettu

source: Enable <span name="distro-name"></span> backports repository
fi: Ota käyttöön <span name="distro-name"></span>takaportit-ohjelmavarasto

source: Applying Changes...
fi: Muutoksia toteutetaan...

source: Snap Applications
fi: Snap-sovellukset

source: <strong>Snap</strong> is a new generation application packaging format developed by <em>Canonical</em>. Even though it was initially developed just for different Ubuntu platforms, currently it works in many other GNU/Linux distributions. It will help application developers to provide a unified package that can work on different platforms. By using snap package format, applications can have their own version of libraries and there is no need to worry about libraries installed in underlying operating system. Snap packages enable developers to bring much newer versions of apps to <span name="distro-name"></span>. Newer versions of KDE, GNOME, browsers or other desktop environment apps will usually build easily on older LTS releases but the complexities of packaging and providing updates have prevented us from delivering them in the past.
fi: <strong>Snap</strong> on uuden sukupolven paketointimuoto jota kehittää <em>Canonical</em>. Vaikkakin aivan alussa kehitetty vain eri Ubuntu-alustoille, se toimii tätänykyä monissa muissakin GNU/Linux-jakeluissa. Se auttaa ohjelmistokehittäjien tuottaa yhtenäisen tietyn ohjelmapaketin joka kuitenkin toimii eri alustoilla. Käytettäessä snap-pakettimuotoa, sovelluksilla voi olla omat kirjastoversiot eikä ole huolta siitä mitä kirjastoja alustana oleva järjestelmä pitää sisällään. Snap-paketit mahdollistavat kehittäjien tuoda <span name="distro-name"></span>:lle paljon uudempia versioita sovelluksistaan. Uudet KDE, GNOME, selaimet tai muut työpöytäympäristösovellusten versiot rakentuvat yleensä helposti vanhoissa LTS-julkaisuissa, mutta paketoinnin monimutkaisuudet menneisyydessä estivät meitä toimittamasta niitä.

source: Learn more
fi: Opi lisää

source: Snap user guide
fi: Snap:in käyttöopas

source: Search Snap Apps
fi: Etsi Snap-sovelluksia

source: If there’s a barrier to Snap app adoption (aside from few apps being made available in the format) it’s knowing which packages are available in the Snap app store. Well, wonder not. Simply pop open a terminal and run the following command:
fi: Jos on olemassa mitään kynnystä sovelluksen Snap-adoptaatiolle (sen ohella että joitakin sovelluksia ylipäätään tehdään käytettäväksi kyseisessä muodossa) niin sehän on tietääkö mitkä sovelluspaketit ovat Snap-sovelluskaupassa tarjolla. No, äläpä enää puntaroi. Pompsauta vain yksinkertaisesti pääte auki ja syötä seuraava käsky:

source: The find command lets you quickly search for and discover snaps available to install from the command line. It can be run with a query after it (e.g., ‘snap find email‘, ‘snap find media’, ‘snap find messaging‘) or without.
fi: Käsky find totetuttaa nopean haun ja tuloksena saapuu tarjolla olevat snap:it jotka voidaan asentaa komentopäätteestä. Se voidaan ajaa myös kyselyn kera (esim. ‘snap find email‘, ‘snap find media‘, ‘snap find messaging)‘ tai ilman.

source: When run without a query you’ll instead see a list of featured snaps.
fi: Ilman kyselyä tulet sen sijaan näkemään listan tällä hetkellä erikseen esille nostetuista snap:eista.

source: See installed apps
fi: Katso asennetut sovellukset

source: Installed some Snaps but can’t remember what? Don’t panic. Use the list command to see an up-to-date list of all Snap apps installed on your system:
fi: Asensit joitakin Snap:eja vaan et muista mitä? Ei syytä paniikkiin. Käytä käskyä list nähdäksesi päivitetyn listauksen kaikista järjestelmääsi asennetuista Snap-sovelluksista:

source: This list also shows you their version number, revision number and the name of the developer who uploaded it (handy when there are multiple versions of the same app in the store, e.g., Telegram).
fi: Tämä lista näyttää myös niiden versionumerot, uudelleentarkistuksen versionumeron sekä sen lataaman kehittäjän nimen (kätevää mikäli tarjolla on useita versioita samasta snap-sovelluksesta kaupassa, esim. Telegram).

source: Install & Remove Snap Apps
fi: Asenna & poista Snap-sovelluksia

source: If you’re used to managing software using apt you’ll instantly find the analogous snap commands easy to remember. You install snap apps with the ‘install’ command, and remove them using the ‘remove’ command.
fi: Mikäli olet tottunut hallinnoimaan ohjelmistoja apt:ia käyttäen, löydät välittömästi samantoimintaiset snap-käskyt jotka ovat helppoja muistaa. Snap-sovellukset asennetaan 'install' käskyllä, poistetaan käyttäen 'remove' käskyä.

source: See details of an App
fi: Katso sovelluksen yksityskohdat

source: You can use this to see detailed information about any snap application, whether it is installed or not. This info includes the application’s release channel, confinement status, size, number of revisions, and more. The snap info --verbose offers a greater overview.
fi: Tätä voit käyttää nähdäksesi yksityskohtaiset tiedot mistä tahansa snap-sovelluksesta, on se sitten asennettu tai ei. Nuo tiedot sisältävät sovelluksen julkaisukanavan, määritelmän sen syntyvaiheista, koon, uudelleenmääritysten määrän, ja enemmän. Laajempi katsaus käskyllä snap info --verbose tulee näkyville.

source: Update a Snap App
fi: Päivitä Snap-sovellus

source: Rather helpfully you probably won’t ever need to remember to install an update to a Snap app. This is because Snapd runs in the background and handles updates automatically (you can, ofc, revert a Snap update or install a specific revision).
fi: Avuliaan tarkoitusperän johdosta sinulla ei milloinkaan ole tarvetta muistaa pävitysten asentamista Snap-sovellukselle. Tämä johtuu siitä että Snapd ajetaan taustalla ja se käsittelee päivitykset automaattisesti (tokihan tietysti voit aina askeltaa Snap-päivityksen taaksepäin tai asentaa vaikkapa jonkun tietyn pakettiversion).

source: Reference
fi: Viite

source: Snap is already installed
fi: Snap on jo asennettu

source: Install Snap
fi: Asenna Snap

source: <strong>Flatpak</strong> is a new generation application distribution framework for GNU/Linux platforms. It introduces a unified packaging format across all GNU/Linux distributions. That means a single package can work on any platform. Flatpak helps application developers to ship their application in a single format which can be installed in any GNU/Linux distribution without worrying about the underlying operating system and its built-in libraries.
fi: <strong>Flatpak</strong>on uuden sukupolven sovellusjakelukehys GNU/Linux-alustoille. Se esittelee yhtenäisen paketointimuodon kaikkien GNU/Linux-jakeluiden välille. Tämä tarkoittaa saman paketin toimivuutta millä tahansa alustalla. Flatpak auttaa ohjelmistokehittäjiä toimittamaan sovelluksensa yhdessä muodossa joka voidaan asentaa mihin tahansa GNU/Linux-jakeluun huolimatta alustana olevasta käyttöjärjestelmästä ja sen sisäänrakennetuista kirjastoista.

source: <span name="distro-name"></span> recommends installing <strong>Flatpak</strong> as it will open a new world of possibilities for you. With Flatpak, you can enjoy the latest release of different software packages as soon as it is packaged by the upstream project and you don't have to wait for your distribution to package it for you.
fi: <span name="distro-name"></span>suosittelee <strong>Flatpak</strong>:in asentamista sillä se avaa sinulle uuden mahdollisuuksien maailman. Flatpak:in avulla, saat nauttia viimeisimmistä ohjelmapakettien julkaisuista heti kun paketointi on tehty sen hallitseman ryhmän toimesta ja sinun ei tarvitse odottaa jakelusi paketointia.

source: Being a user friendly GNU/Linux distribution, <span name='distro-name'></span> allows you to install Flatpak with a single click. After first time configuration, you can use GNOME Software to install Flatpak packages.
fi: Käyttäjäystävällinen GNU/Linux jakelu kun on, <span name='distro-name'></span>antaa sinun asentaa Flatpak:in yhdellä klikkauksella. Ensiasetusten jälkeen, voit käyttää kauppaa GNOME Software asentaaksesi Flatpak-paketteja.

source: Flatpak is installed. Please reboot for the service to start
fi: Flatpak asennettu. Uudelleenkäynnistä tietokone jotta palvelu käynnistyy.

source: Install & Configure Flatpak
fi: Asenna & määritä Flatpak

source: <strong>skippy-xd</strong> adds a window expose type capability through a keyboard shortcut. For most desktops skippy-xd works well. Note: For some multi-monitor setups, graphics drivers and within virtual machines such as VirtualBox it may not work correctly.
fi: <strong>skippy-xd</strong>lisää ikkunanäkymätyyppisen ominaisuuden näppäinoikopolun kautta. Useimmilla työpöydillä skippy-xd toimii hyvin. Merkillepantavaa: joillakin monen näytön järjestelmillä, grafiikka-ajureilla tai virtuaalikoneen sisällä kuten Virtualbox se ei välttämättä toimi oikein.

source: By default the installer will create a custom keyboard shortcut CTRL+grave ('the key above the tab'). You can define or change the keyboard shortcut through the Settings - Keyboard - Custom Shortcuts option. Use the command <strong>skippy-xd-toggle</strong> when defining your own custom keyboard shortcut.
fi: Vakiollisesti asennusohjelma luo muokatun näppäinoikopolun CTRL+gravis ('näppäin askelpalauttimen vieressä vasemmalla puolella suomalaisessa näppäimistössä, ` ). Voit määritellä tai muuttaa näppäinoikopolun: Asetukset - Näppäimistö - Oikopolut kautta. Käytä käskyä <strong>skippy-xd-toggle</strong> kun määrität omia näppäinoikopolkujasi

source: skippy-xd is installed
fi: skippy-xd on asennettu

source: Install & Configure skippy-xd
fi: Asenna ja määritä skippy-xd

source: <strong>Steam</strong> is a digital distribution platform developed by Valve Corporation offering digital rights management (DRM), multiplayer gaming and social networking services. Steam provides the user with installation and automatic updating of games on multiple computers, and community features such as friends lists and groups, cloud saving, and in-game voice and chat functionality. The software provides a freely available application programming interface (API) called Steamworks, which developers can use to integrate many of Steam's functions into their products, including networking, matchmaking, in-game achievements, micro-transactions, and support for user-created content through Steam Workshop.
fi: <strong>Steam</strong> on Valve Corporation:in kehittämä digitaalinen jakelualusta joka tarjoaa digitaalisten oikeuksien hallinnan (DRM), moninpelaamista ja sosiaalisen verkon palveluja. Steam tarjoaa käyttäjälle pelien asennuksen ja automaattiset päivitykset useilla tietokoneilla, ja yhteisöominaisuudet kuten ystävälistat ja ryhmät, pilvitallennus ja pelin aikana tapahtuvan äänikeskustelun sekä tavallisen chat-keskustelun. Ohjelmisto tarjoaa ilmaiseksi sovellusohjelmoinnin käyttöliittymän (API) nimeltä Steamworks, jota kehittäjät voivat käyttää liittääkseen monia Steam:in ominaisuuksia tuotteisiinsa, sisältäen verkkotoiminnot, pelikilpailun luonnin, pelinsisäiset pelisaavutukset, mikro-rahansiirrot, ja tuen käyttäjien luomalle sisällölle Steam Workshop:in kautta.

source: Being proprietary software, Steam is not included in the primary repositories of <span name="distro-name"></span>. However, to provide more choice to users, Steam is shipped as a part of the <em>Multiverse</em> repository. <span name="distro-name"></span> provides you the option to enable the <em>Multiverse</em> repository and to install Steam with a single mouse click.
fi: Steam:in ollessa omisteinen ohjelma, sitä ei ole sisällytetty <span name="distro-name"></span> päävarastoihin. Mahdollistamaan enemmän vaihtoehtoja käyttäjälle, se on kuitenkin tarjolla osana <em>Multiverse</em>ohjelmavarastoa. <span name="distro-name"></span>tarjoaa mahdollisuuden ottaaksesi <em>Multiverse</em> ohjelmavaraston käyttöön ja asentaaksesi Steam:in yhdellä hiirennapin klikkauksella.

source: Steam is installed
fi: Steam on asennettu

source: Install & Configure Steam
fi: Asenna ja määritä Steam

source: <strong>Dropbox</strong> is a popular proprietary file sharing and storage solution.
fi: <strong>Dropbox</strong>on suosittu omisteinen tiedostonjako ja varastointiratkaisu.

source: Being proprietary software, Dropbox is not included in the primary repositories of <span name="distro-name"></span>. However, to provide more choice to users, Dropbox is shipped as a part of the <em>Multiverse</em> repository. <span name="distro-name"></span> provides you the option to enable the <em>Multiverse</em> repository and to install Dropbox with a single mouse click.
fi: Dropbox on omisteinen ohjelmisto joten sitä ei ole sisällytetty <span name="distro-name"></span> pääohjelmavarastoihin. Joka tapauksessa, enemmän käyttäjävaihtoehtoja mahdollistaaksemme, Dropbox toimitetaan osana <em>Multiverse</em> ohjelmavarastoa. <span name="distro-name"></span>tarjoaa sinulle vaihtoehdon kytkeä <em>Multiverse</em>käyttöön asentaaksesi Dropbox:in yhdellä hiirennapin klikkauksella.

source: After installing, logout and login and follow the dropbox instructions that are then displayed.
fi: Asennuksen jälkeen, kirjaudu ulos ja takaisin sisään sekä seuraa näkyville tulevia Dropbox:in ohjeita.

source: Dropbox is installed
fi: Dropbox on asennettu

source: Install & Configure Dropbox
fi: Asenna ja määritä Dropbox

source: Nemo Share allows you to quickly share a folder from the Nemo file manager without requiring root access.
fi: Nemo Share mahdollistaa nopean kansionjaon Nemo-tiedostonhallinnasta ilman vaatimusta root-käyttäjän oikeuksille.

source: Nemo Share is installed
fi: Nemo Share on asennettu

source: Install Nemo Share
fi: Asenna Nemo Share
