Repository: Phosphorus-M/budgie-welcome
Catalog: data/po/community/*.po
Languages: fi

source: Community
fi: Yhteisö

source: Get Support
fi: Pyydä tukea

source: To get support for <span name="distro-name"></span> specific issues, the <span name="distro-name"></span> Discourse website is the best place to go. You can raise issues and help other members of our growing community.
fi: Saadaksesi tukea <span name="distro-name"></span>liittyviin ongelmiin, sivusto <span name="distro-name"></span> Discourse on siihen paras paikka. Voit nostaa esiin uusia ongelmatilanteita sekä auttaa muita jäseniä kasvavassa yhteisössämme.

source: It appears you are not connected to the Internet. Please check your connection to access this content.
fi: Vaikuttaa siltä, ​​että et ole muodostanut Internet-yhteyttä. Tarkista yhteytesi käyttääksesi tätä sisältöä.

source: Sorry, Welcome was unable to establish a connection.
fi: Pahoittelut, Tervetuloa-sovellus ei kyennyt muodostamaan yhteyttä.

source: Retry
fi: Yritä uudelleen

source: An alternative way to get in touch is via our official IRC (Internet Relay Chat) channel.
fi: Vaihtoehtoinen tapa olla yhteydessä on virallisen IRC-kanavamme (Internet Relay Chat) kautta.

source: If you disconnect from the channel you will not receive a notification of any reply. So either leave an IRC session open - or we recommend connecting to all ubuntu IRC channels via an IRC bouncer.
fi: Mikäli katkaiset yhteyden kanavaan, et voi saada ilmoituksia tai minkäänlaisia vastauksia. Täten jätä joko IRC-istunto avoimeksi - tai suosittelemme yhdistämään kaikkiin Ubuntu IRC-kanaviin IRC:n sisäänheittäjän kautta.

source: #Ubuntu-Budgie on FreeNode
fi: #Ubuntu-Budgie palvelimella FreeNode

source: Forum
fi: Keskustelufoorumi

source: You can also get support for <span name="distro-name"></span> through these official Ubuntu forums:
fi: <span name="distro-name"></span> tukea saat myös näiden virallisten Ubuntu keskustelufoorumien kautta:

source: Social Networks
fi: Sosiaaliset verkot

source: <span name="distro-name"></span> is active on the following social networks.
fi: <span name="distro-name"></span>on aktiivinen seuraavissa sosiaalisissa verkoissa.

source: Facebook Group
fi: Facebook-ryhmä

source: Facebook Page
fi: Facebook-sivu

source: Local Communities
fi: Paikalliset yhteisöt

source: In addition to global communities, <span name="distro-name"></span> also encourages local communities to support users coming from diverse backgrounds. In this section, you can discover our local communities. If you are interested to manage a local community for <span name="distro-name"></span> please let us know, so that we can list it here and improve its visibility.
fi: Maailmanlaajuisten yhteisöjen lisäksi, <span name="distro-name"></span>rohkaisee paikallisia yhteisöjä antamaan myös tukea käyttäjille jotka omaavat kirjavan elämäntaustan. Tästä osiosta löydät paikalliset yhteisömme. Mikäli olet kiinnostunut hallinnoimaan paikallista yhteisöä <span name="distro-name"></span>eteen, ole ystävällinen ja kerro siitä meille, jotta voimme lisätä sen listaukseen parantaakseen sen näkyvyyttä.

source: Ubuntu Budgie Brasil
fi: Ubuntu Budgie Brasilia
